# IsAcceptableForMultistoryStairs Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MultistoryStairs..::..IsAcceptableForMultistoryStairs Method
MultistoryStairs Class See Also
---
Checks if the given stairs can be used to create a multistory stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018
# Syntax
C#
---
```text
public static bool IsAcceptableForMultistoryStairs(
	Stairs stairs
)
```

Visual Basic
---
```text
Public Shared Function IsAcceptableForMultistoryStairs ( _
	stairs As Stairs _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsAcceptableForMultistoryStairs(
	Stairs^ stairs
)
```

# ### Parameters
stairs
    Type: Autodesk.Revit.DB.Architecture..::..Stairs The given stairs to check.
# ### Return Value
Returns true if the stairs can be used to create a multistory stairs; otherwise returns false.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace